{
    "title":"How to learn Javascript",
    "content":"What does it take to bring web pages to life? A little know-how, insight, and of course, JavaScript.\r\n\r\n    As one of the most well-known programming languages, JavaScript is a highly relevant tool. Understanding it has become an asset in today’s digital world, and there are plenty of reasons why.\r\n    \r\n    In this article, we’ll review it in detail and show you how to learn JavaScript to rise to your full potential.\r\n    \r\n    What Is JavaScript?\r\n    JavaScript (JS) is a programming language for creating dynamic website content. With it, developers can update both HTML and CSS, making web pages more responsive and interactive for users. \r\n    \r\n    JavaScript was created in 1995 by Brendan Eich while working for Netscape Communications. At the time, the language was called Mocha, but it was renamed LiveScript and later JavaScript to improve its marketing appeal. Today, it’s one of the core technologies of the World Wide Web, and both the client and server sides use it.\r\n    \r\n    The Benefits Of Learning JavaScript\r\n    The advantages of JavaScript are varied and many. There are so many benefits and reasons to learn it, which we’ll break down below. \r\n    \r\n    JavaScript Is Easy to Learn. JavaScript is relatively simple and easy to learn compared to other popular programming languages like C++, Ruby, and Python. Its intuitive nature makes it easy to both pick up and implement.\r\n    JavaScript Is Versatile. JavaScript isn’t limited to front-end development. You can also use it in the back-end with tools like Node.js and Express",
    "metadesc":"It might be hyperbole to say that JavaScript is a developers best (digital) friend — but it would certainly be hard to get by without it. According to a recent survey conducted by Stack Overflow, JavaScript is the world s most popular programming language, with an incredible 69.7 percent of the 90,000 developers polled.",
    "author":"Johna Doe",
    "date":"2018-01-01",
    "picture":"https://www.google.com/images/branding/googlelogo/2x/googlelogo_color_272x92dp.png",
    "slug":"How-to-Learn-JavaScript"
}